app/views/order_line_items/create.js.erb

SELECT SUM("order_line_items"."order_item_qty") FROM "order_line_items" WHERE "order_line_items"."order_id" = ?  [["order_id", 4]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
$('#cart').html("<%= @order.order_line_items.sum(:order_item_qty) %>");
$('#item_qnt').html("<%= InventoryItem.find(@order_line_item.inventory_item_id).quantity %>");