app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at desc
---
  def index
    @articles = Article.all

SELECT "articles".* FROM "articles" ORDER BY created_at desc
---
  def show
    @articles_in_order = Article.all.order("created_at desc")

INSERT INTO "articles" ("name", "description", "content", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save