app/controllers/inventory_items_controller.rb

  def index

    if params[:inventory_item]
      @inventory_items = InventoryItem.where('name LIKE ?', "%#{params[:inventory_item]}%").page(params[:page]).per(9)
    else
      @inventory_items = InventoryItem.page(params[:page]).per(9)
---
SELECT  "inventory_items".* FROM "inventory_items" WHERE (name LIKE '%nike%') LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "inventory_items" WHERE (name LIKE '%nike%') LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "inventory_items" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "inventory_items".* FROM "inventory_items" WHERE (name LIKE '%nike%')

    def set_inventory_item
      @inventory_item = InventoryItem.find(params[:id])
---
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]