app/controllers/orders_controller.rb

UPDATE "orders" SET "cookies" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["cookies", "User:1;/checkout;01/30/19 05:53 PM;User:1;/orders/11;01/30/19 05:53 PM;User:1;/orders/11;01/30/19 05:53 PM;"], ["updated_at", "2019-01-30 10:53:21.910167"], ["id", 11]]
UPDATE "orders" SET "user_id" = ?, "total_amount" = ?, "state" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["user_id", 1], ["total_amount", 2800.0], ["state", 2], ["updated_at", "2019-02-10 11:42:44.779117"], ["id", 14]]
SELECT "order_line_items".* FROM "order_line_items" WHERE "order_line_items"."order_id" = ?  [["order_id", 11]]
UPDATE "inventory_items" SET "sold_quantity" = ?, "updated_at" = ? WHERE "inventory_items"."id" = ?  [["sold_quantity", 8], ["updated_at", "2019-01-30 10:53:37.773879"], ["id", 1]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update

    @order.cookies = cookies[:visited]
    cookies[:visited] = nil
    @order.save
    # binding.pry
    respond_to do |format|
      if @order.update(order_params)
        if user_signed_in? && current_user.admin
          format.html { redirect_to @order, notice: 'Order was successfully updated.' }
          format.json { render :show, status: :ok, location: @order }
        else
          if @order.state == 1
            # binding.pry
            format.html { redirect_to order_path, notice: 'Updated'}
            update_inventory_item_quantity_when_update_order
          elsif @order.state == 2
            @order.order_line_items.each do |f|
            f.fixed_item_price = f.inventory_item.price
            f.save
            @related_item = InventoryItem.find(f.inventory_item_id)
            @related_item.sold_quantity = @related_item.sold_quantity.to_i + f.order_item_qty.to_i

SELECT "order_line_items".* FROM "order_line_items" WHERE "order_line_items"."order_id" = ?  [["order_id", 11]]
UPDATE "inventory_items" SET "quantity" = ?, "updated_at" = ? WHERE "inventory_items"."id" = ?  [["quantity", 6], ["updated_at", "2019-01-31 02:28:35.859648"], ["id", 1]]
DELETE FROM "order_line_items" WHERE "order_line_items"."id" = ?  [["id", 7]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 11]]
---
  def destroy
    if @order.id == cookies[:order_id].to_i

      @order.order_line_items.each do |f|
        #binding.pry
        @inventory_item = f.inventory_item
        @inventory_item.quantity = @inventory_item.quantity + f.order_item_qty
        @inventory_item.save
      end

      @order.destroy