app/controllers/order_line_items_controller.rb

SELECT "order_line_items".* FROM "order_line_items"
---
  def index
    @order_line_items = OrderLineItem.all

SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "inventory_items" SET "quantity" = ?, "updated_at" = ? WHERE "inventory_items"."id" = ?  [["quantity", 0], ["updated_at", "2019-01-30 05:53:57.316441"], ["id", 1]]
INSERT INTO "order_line_items" ("inventory_item_id", "order_id", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["inventory_item_id", 1], ["order_id", 4], ["total_price", 700.0], ["created_at", "2019-01-30 05:54:04.350658"], ["updated_at", "2019-01-30 05:54:04.350658"]]
UPDATE "order_line_items" SET "order_item_qty" = ?, "total_price" = ?, "updated_at" = ? WHERE "order_line_items"."id" = ?  [["order_item_qty", 2], ["total_price", 1400.0], ["updated_at", "2019-01-30 06:22:46.726401"], ["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def create
    #order = current_order
    #@order_line_item = OrderLineItem.new(order_line_item_params)
    #@order.save
    #session[:order_id] = @order.id
    inventory_item = InventoryItem.find(params[:inventory_item_id])

    if inventory_item.quantity == nil || inventory_item.quantity <= 0
      redirect_to home_path, notice: 'not enough.'
    else

      @order_line_item = @order.add_inventory_item(inventory_item)
      #binding.pry

      inventory_item.quantity = inventory_item.quantity - 1
      inventory_item.save
      #@order_line_item = OrderLineItem.new(order_line_item_params)
      respond_to do |format|
        if @order_line_item.save
          format.html { redirect_to @order_line_item.order, notice: 'Order line item was successfully created.' }

UPDATE "inventory_items" SET "quantity" = ?, "updated_at" = ? WHERE "inventory_items"."id" = ?  [["quantity", 1], ["updated_at", "2019-01-30 06:13:44.286067"], ["id", 1]]
DELETE FROM "order_line_items" WHERE "order_line_items"."id" = ?  [["id", 1]]
---
  def destroy
    #@order = current_order
    #@order_line_item = @order.order_line_items.find(params[:id])
    #@order_line_item.destroy
    #@order_line_items = @order.order_line_items
    #binding.pry
    @inventory_item = @order_line_item.inventory_item
    @inventory_item.quantity = @inventory_item.quantity + @order_line_item.order_item_qty
    @inventory_item.save
    @order_line_item.destroy

SELECT  "order_line_items".* FROM "order_line_items" WHERE "order_line_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_order_line_item
      @order_line_item = OrderLineItem.find(params[:id])