app/controllers/specific_items_controller.rb

  def create
    @specific_item = SpecificItem.new(specific_item_params)

    respond_to do |format|
      if @specific_item.save
---
INSERT INTO "specific_items" ("inventory_item_id", "serial_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["inventory_item_id", 1], ["serial_number", "1231241"], ["created_at", "2019-01-30 05:53:40.156256"], ["updated_at", "2019-01-30 05:53:40.156256"]]

    def set_specific_item
      @specific_item = SpecificItem.find(params[:id])
---
SELECT  "specific_items".* FROM "specific_items" WHERE "specific_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def increase_inventory_item(specific_item)
      inventory_item = InventoryItem.find(specific_item.inventory_item_id.to_s)
      inventory_item.increment(:quantity)
      inventory_item.save
---
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "inventory_items" SET "quantity" = ?, "updated_at" = ? WHERE "inventory_items"."id" = ?  [["quantity", 3], ["updated_at", "2019-01-30 06:16:21.481920"], ["id", 1]]