app/controllers/static_pages_controller.rb

SELECT COUNT(*) FROM "inventory_items"
SELECT "inventory_item_categories".* FROM "inventory_item_categories"
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."sold_quantity" = ? LIMIT ?  [["sold_quantity", 0], ["LIMIT", 1]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def home
  	# @static_pages  = InventoryItem.paginate(page: params[:page], :per_page => 9)
    @static_pages = InventoryItem.page(params[:page]).per(20)
  	@inventory_item_categories = InventoryItemCategory.all
    #@inventory_models = InventoryModels.all
    @order_line_item = @order.order_line_items.new
    @best_seller = InventoryItem.find_by(sold_quantity: InventoryItem.maximum(:sold_quantity))
    @looked_item = InventoryItem.find(cookies[:looked_items])