app/controllers/static_pages_controller.rb

  def home
  	# @static_pages  = InventoryItem.paginate(page: params[:page], :per_page => 9)
    @static_pages = InventoryItem.page(params[:page]).per(10)
---
SELECT  "inventory_items".* FROM "inventory_items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "inventory_items" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]